Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTSH/atdf/PIC32CX2051MTSH128.atdf
      <value-group caption="Variation Detection Channel Selection" name="EMAFE_MR__VAR_CH">
        <value caption="Channel 0 is selected." name="CH0" value="0x0"/>
        <value caption="Channel 1 is selected." name="CH1" value="0x1"/>
        <value caption="Channel 2 is selected." name="CH2" value="0x2"/>
        <value caption="Channel 3 is selected." name="CH3" value="0x3"/>
        <value caption="Channel 4 is selected." name="CH4" value="0x4"/>
        <value caption="Channel 5 is selected." name="CH5" value="0x5"/>
        <value caption="Channel 6 is selected." name="CH6" value="0x6"/>
      </value-group>
      <value-group caption="First Channel to Compare" name="EMAFE_CDCR__CHA_IDX">
        <value caption="Channel 0 is used to perform comparison." name="CH0" value="0x0"/>
        <value caption="Channel 1 is used to perform comparison." name="CH1" value="0x1"/>
        <value caption="Channel 2 is used to perform comparison." name="CH2" value="0x2"/>
        <value caption="Channel 3 is used to perform comparison." name="CH3" value="0x3"/>
        <value caption="Channel 4 is used to perform comparison." name="CH4" value="0x4"/>
        <value caption="Channel 5 is used to perform comparison." name="CH5" value="0x5"/>
        <value caption="Channel 6 is used to perform comparison." name="CH6" value="0x6"/>
      </value-group>
      <value-group caption="Second Channel to Compare" name="EMAFE_CDCR__CHB_IDX">
        <value caption="Channel 0 is used to perform comparison" name="CH0" value="0x0"/>
        <value caption="Channel 1 is used to perform comparison" name="CH1" value="0x1"/>
        <value caption="Channel 2 is used to perform comparison" name="CH2" value="0x2"/>
        <value caption="Channel 3 is used to perform comparison" name="CH3" value="0x3"/>
        <value caption="Channel 4 is used to perform comparison" name="CH4" value="0x4"/>
        <value caption="Channel 5 is used to perform comparison." name="CH5" value="0x5"/>
        <value caption="Channel 6 is used to perform comparison." name="CH6" value="0x6"/>
      </value-group>
      <value-group caption="Data Format" name="EMAFE_EMR__FORMAT">
        <value caption="Index of channel is added in register EMAFE_DMA_DATA. 24-bit dynamic range. (default)." name="NB_CHANNEL" value="0x0"/>
        <value caption="24-bit value with sign extension up to 32-bit applied to registers EMAFE_DMA_DATA and EMAFE _DATAx. 24-bit dynamic range" name="SIGNEXTEND" value="0x1"/>
        <value caption="32-bit full range signed extension is applied in EMAFE_DMA_DATA and EMAFE _DATAx. 32-bit dynamic range." name="FULLRANGE" value="0x2"/>
      </value-group>
      <value-group caption="LPF Clock Prescaler Ratio" name="EMAFE_EMR__MCLKDIV_LPF">
        <value caption="LPFIF clock is MCLK/1." name="MCLK" value="0x0"/>
        <value caption="LPFIF clock is MCLK/2." name="MCLKDIV2" value="0x1"/>
        <value caption="LPFIF clock is MCLK/4." name="MCLKDIV4" value="0x2"/>
        <value caption="LPFIF clock is MCLK/8. (Default)" name="MCLKDIV8" value="0x3"/>
        <value caption="LPFIF clock is MCLK/16." name="MCLKDIV16" value="0x4"/>
        <value caption="LPFIF clock is MCLK/32." name="MCLKDIV32" value="0x5"/>
      </value-group>
      <value-group caption="OSR of the Decimation Filters" name="EMAFE_EMR__OSR">
        <value caption="OSR of the system is 8." name="OSR8" value="0x0"/>
        <value caption="OSR of the system is 16." name="OSR16" value="0x1"/>
        <value caption="OSR of the system is 32." name="OSR32" value="0x2"/>
        <value caption="OSR of the system is 64 (Default)." name="OSR64" value="0x3"/>
      </value-group>
      <value-group caption="Channel A Index" name="EMAFE_CHA_CFG1__IDX">
        <value caption="Channel 0 is selected." name="CH0" value="0x0"/>
        <value caption="Channel 1 is selected." name="CH1" value="0x1"/>
        <value caption="Channel 2 is selected." name="CH2" value="0x2"/>
        <value caption="Channel 3 is selected." name="CH3" value="0x3"/>
        <value caption="Channel 4 is selected." name="CH4" value="0x4"/>
        <value caption="Channel 5 is selected." name="CH5" value="0x5"/>
        <value caption="Channel 6 is selected." name="CH6" value="0x6"/>
      </value-group>
      <value-group caption="Condition Applied for Detection on Channel A" name="EMAFE_CHA_CFG1__COND">
        <value caption="Selected channel data is lower than THRESH1 OR higher than THRESH2." name="OR" value="0"/>
        <value caption="Selected channel data is lower than THRESH1 AND higher than THRESH2." name="AND" value="1"/>
      </value-group>
      <value-group caption="Channel B Index" name="EMAFE_CHB_CFG1__IDX">
        <value caption="Channel 0 is selected." name="CH0" value="0x0"/>
        <value caption="Channel 1 is selected." name="CH1" value="0x1"/>
        <value caption="Channel 2 is selected." name="CH2" value="0x2"/>
        <value caption="Channel 3 is selected." name="CH3" value="0x3"/>
        <value caption="Channel 4 is selected." name="CH4" value="0x4"/>
        <value caption="Channel 5 is selected." name="CH5" value="0x5"/>
        <value caption="Channel 6 is selected." name="CH6" value="0x6"/>
      </value-group>
      <value-group caption="Condition Applied for Detection on Channel B" name="EMAFE_CHB_CFG1__COND">
        <value caption="Selected channel data is lower than THRESH1 OR higher than THRESH2." name="OR" value="0"/>
        <value caption="Selected channel data is lower than THRESH1 AND higher than THRESH2." name="AND" value="1"/>
      </value-group>
      <value-group caption="Write Protection Key" name="EMAFE_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPCFEN and WPITEN bit. Always reads as 0." name="PASSWD" value="0x768070"/>
      </value-group>
      <value-group caption="Write Protection Key" name="EMAFE_PWPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation. Always reads as 0." name="PASSWD" value="0x504443"/>
      </value-group>
    </module>
    <module caption="Flexible Serial Communication" name="FLEXCOM" id="11268" version="ZH">
      <register-group name="FLEXCOM">
        <register caption="FLEXCOM Mode Register" name="FLEX_MR" offset="0x000" rw="RW" size="4">
          <bitfield caption="FLEXCOM Operating Mode" mask="0x00000003" name="OPMODE" values="FLEX_MR__OPMODE"/>
        </register>
