Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTSH/atdf/PIC32CX2051MTSH128.atdf
        <register caption="Slave Configuration Register" name="MATRIX_SCFG" offset="0x0040" rw="RW" size="4" count="16">
          <bitfield caption="Maximum Bus Grant Duration for Masters" mask="0x000001FF" name="SLOT_CYCLE"/>
          <bitfield caption="Default Master Type" mask="0x00030000" name="DEFMSTR_TYPE" values="MATRIX_SCFG__DEFMSTR_TYPE"/>
          <bitfield caption="Fixed Default Master" mask="0x003C0000" name="FIXED_DEFMSTR"/>
        </register>
        <register-group name="MATRIX_PR" size="8" name-in-module="MATRIX_PR" offset="0x0080" count="16"/>
        <register caption="Master Remap Control Register" name="MATRIX_MRCR" offset="0x0100" rw="RW" size="4">
          <bitfield caption="Remap Command Bit for Master 0" mask="0x00000001" name="RCB0"/>
          <bitfield caption="Remap Command Bit for Master 1" mask="0x00000002" name="RCB1"/>
          <bitfield caption="Remap Command Bit for Master 2" mask="0x00000004" name="RCB2"/>
          <bitfield caption="Remap Command Bit for Master 3" mask="0x00000008" name="RCB3"/>
          <bitfield caption="Remap Command Bit for Master 4" mask="0x00000010" name="RCB4"/>
          <bitfield caption="Remap Command Bit for Master 5" mask="0x00000020" name="RCB5"/>
          <bitfield caption="Remap Command Bit for Master 6" mask="0x00000040" name="RCB6"/>
          <bitfield caption="Remap Command Bit for Master 7" mask="0x00000080" name="RCB7"/>
          <bitfield caption="Remap Command Bit for Master 8" mask="0x00000100" name="RCB8"/>
          <bitfield caption="Remap Command Bit for Master 9" mask="0x00000200" name="RCB9"/>
          <bitfield caption="Remap Command Bit for Master 10" mask="0x00000400" name="RCB10"/>
          <bitfield caption="Remap Command Bit for Master 11" mask="0x00000800" name="RCB11"/>
          <bitfield caption="Remap Command Bit for Master 12" mask="0x00001000" name="RCB12"/>
          <bitfield caption="Remap Command Bit for Master 13" mask="0x00002000" name="RCB13"/>
          <bitfield caption="Remap Command Bit for Master 14" mask="0x00004000" name="RCB14"/>
          <bitfield caption="Remap Command Bit for Master 15" mask="0x00008000" name="RCB15"/>
        </register>
        <register caption="Special Function Register" name="MATRIX_SFR" offset="0x0110" rw="RW" size="4" count="16">
          <bitfield caption="Special Function Register Fields" mask="0xFFFFFFFF" name="SFR"/>
        </register>
        <register caption="Master Error Interrupt Enable Register" name="MATRIX_MEIER" offset="0x0150" rw="W" size="4">
          <bitfield caption="Master 0 Access Error" mask="0x00000001" name="MERR0"/>
          <bitfield caption="Master 1 Access Error" mask="0x00000002" name="MERR1"/>
          <bitfield caption="Master 2 Access Error" mask="0x00000004" name="MERR2"/>
          <bitfield caption="Master 3 Access Error" mask="0x00000008" name="MERR3"/>
          <bitfield caption="Master 4 Access Error" mask="0x00000010" name="MERR4"/>
          <bitfield caption="Master 5 Access Error" mask="0x00000020" name="MERR5"/>
          <bitfield caption="Master 6 Access Error" mask="0x00000040" name="MERR6"/>
          <bitfield caption="Master 7 Access Error" mask="0x00000080" name="MERR7"/>
          <bitfield caption="Master 8 Access Error" mask="0x00000100" name="MERR8"/>
          <bitfield caption="Master 9 Access Error" mask="0x00000200" name="MERR9"/>
          <bitfield caption="Master 10 Access Error" mask="0x00000400" name="MERR10"/>
          <bitfield caption="Master 11 Access Error" mask="0x00000800" name="MERR11"/>
          <bitfield caption="Master 12 Access Error" mask="0x00001000" name="MERR12"/>
          <bitfield caption="Master 13 Access Error" mask="0x00002000" name="MERR13"/>
          <bitfield caption="Master 14 Access Error" mask="0x00004000" name="MERR14"/>
          <bitfield caption="Master 15 Access Error" mask="0x00008000" name="MERR15"/>
        </register>
        <register caption="Master Error Interrupt Disable Register" name="MATRIX_MEIDR" offset="0x0154" rw="W" size="4">
          <bitfield caption="Master 0 Access Error" mask="0x00000001" name="MERR0"/>
          <bitfield caption="Master 1 Access Error" mask="0x00000002" name="MERR1"/>
          <bitfield caption="Master 2 Access Error" mask="0x00000004" name="MERR2"/>
          <bitfield caption="Master 3 Access Error" mask="0x00000008" name="MERR3"/>
          <bitfield caption="Master 4 Access Error" mask="0x00000010" name="MERR4"/>
          <bitfield caption="Master 5 Access Error" mask="0x00000020" name="MERR5"/>
          <bitfield caption="Master 6 Access Error" mask="0x00000040" name="MERR6"/>
          <bitfield caption="Master 7 Access Error" mask="0x00000080" name="MERR7"/>
          <bitfield caption="Master 8 Access Error" mask="0x00000100" name="MERR8"/>
          <bitfield caption="Master 9 Access Error" mask="0x00000200" name="MERR9"/>
          <bitfield caption="Master 10 Access Error" mask="0x00000400" name="MERR10"/>
          <bitfield caption="Master 11 Access Error" mask="0x00000800" name="MERR11"/>
          <bitfield caption="Master 12 Access Error" mask="0x00001000" name="MERR12"/>
          <bitfield caption="Master 13 Access Error" mask="0x00002000" name="MERR13"/>
          <bitfield caption="Master 14 Access Error" mask="0x00004000" name="MERR14"/>
          <bitfield caption="Master 15 Access Error" mask="0x00008000" name="MERR15"/>
        </register>
        <register caption="Master Error Interrupt Mask Register" name="MATRIX_MEIMR" offset="0x0158" rw="R" size="4">
          <bitfield caption="Master 0 Access Error" mask="0x00000001" name="MERR0"/>
          <bitfield caption="Master 1 Access Error" mask="0x00000002" name="MERR1"/>
          <bitfield caption="Master 2 Access Error" mask="0x00000004" name="MERR2"/>
          <bitfield caption="Master 3 Access Error" mask="0x00000008" name="MERR3"/>
          <bitfield caption="Master 4 Access Error" mask="0x00000010" name="MERR4"/>
          <bitfield caption="Master 5 Access Error" mask="0x00000020" name="MERR5"/>
          <bitfield caption="Master 6 Access Error" mask="0x00000040" name="MERR6"/>
          <bitfield caption="Master 7 Access Error" mask="0x00000080" name="MERR7"/>
          <bitfield caption="Master 8 Access Error" mask="0x00000100" name="MERR8"/>
          <bitfield caption="Master 9 Access Error" mask="0x00000200" name="MERR9"/>
          <bitfield caption="Master 10 Access Error" mask="0x00000400" name="MERR10"/>
          <bitfield caption="Master 11 Access Error" mask="0x00000800" name="MERR11"/>
          <bitfield caption="Master 12 Access Error" mask="0x00001000" name="MERR12"/>
          <bitfield caption="Master 13 Access Error" mask="0x00002000" name="MERR13"/>
          <bitfield caption="Master 14 Access Error" mask="0x00004000" name="MERR14"/>
          <bitfield caption="Master 15 Access Error" mask="0x00008000" name="MERR15"/>
        </register>
