Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTSH/atdf/PIC32CX2051MTSH128.atdf
      <value-group caption="Transfer Size" name="MEM2MEM_MR__TSIZE">
        <value caption="The buffer size is defined in bytes." name="T_8BIT" value="0x0"/>
        <value caption="The buffer size is defined in half-words (16-bit)." name="T_16BIT" value="0x1"/>
        <value caption="The buffer size is defined in words (32-bit). Default value." name="T_32BIT" value="0x2"/>
      </value-group>
      <value-group caption="Write Protection Key" name="MEM2MEM_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN, WPITEN bits. Always reads as 0." name="PASSWD" value="0x4D454D"/>
      </value-group>
      <value-group caption="Write Protection Key" name="MEM2MEM_PWPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation. Always reads as 0." name="PASSWD" value="0x504443"/>
      </value-group>
    </module>
    <module caption="Analog Oscillator" name="OSC" id="version">
      <register-group name="OSC"/>
    </module>
    <module caption="Peripheral DMA Controller" name="PDC" id="6031" version="K">
      <register-group name="PDC">
        <register caption="Receive Pointer Register" name="PERIPH_RPR" offset="0x00" rw="RW" size="4">
          <bitfield caption="Receive Pointer Register" mask="0xFFFFFFFF" name="RXPTR"/>
        </register>
        <register caption="Receive Counter Register" name="PERIPH_RCR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Receive Counter Register" mask="0x0000FFFF" name="RXCTR"/>
        </register>
        <register caption="Transmit Pointer Register" name="PERIPH_TPR" offset="0x08" rw="RW" size="4">
          <bitfield caption="Transmit Counter Register" mask="0xFFFFFFFF" name="TXPTR"/>
        </register>
        <register caption="Transmit Counter Register" name="PERIPH_TCR" offset="0x0C" rw="RW" size="4">
          <bitfield caption="Transmit Counter Register" mask="0x0000FFFF" name="TXCTR"/>
        </register>
        <register caption="Receive Next Pointer Register" name="PERIPH_RNPR" offset="0x10" rw="RW" size="4">
          <bitfield caption="Receive Next Pointer" mask="0xFFFFFFFF" name="RXNPTR"/>
        </register>
        <register caption="Receive Next Counter Register" name="PERIPH_RNCR" offset="0x14" rw="RW" size="4">
          <bitfield caption="Receive Next Counter" mask="0x0000FFFF" name="RXNCTR"/>
        </register>
        <register caption="Transmit Next Pointer Register" name="PERIPH_TNPR" offset="0x18" rw="RW" size="4">
          <bitfield caption="Transmit Next Pointer" mask="0xFFFFFFFF" name="TXNPTR"/>
        </register>
        <register caption="Transmit Next Counter Register" name="PERIPH_TNCR" offset="0x1C" rw="RW" size="4">
          <bitfield caption="Transmit Counter Next" mask="0x0000FFFF" name="TXNCTR"/>
        </register>
        <register caption="Transfer Control Register" name="PERIPH_PTCR" offset="0x20" rw="W" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Receiver Transfer Disable" mask="0x00000002" name="RXTDIS"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Transmitter Transfer Disable" mask="0x00000200" name="TXTDIS"/>
          <bitfield caption="Receiver Circular Buffer Enable" mask="0x00010000" name="RXCBEN"/>
          <bitfield caption="Receiver Circular Buffer Disable" mask="0x00020000" name="RXCBDIS"/>
          <bitfield caption="Transmitter Circular Buffer Enable" mask="0x00040000" name="TXCBEN"/>
          <bitfield caption="Transmitter Circular Buffer Disable" mask="0x00080000" name="TXCBDIS"/>
          <bitfield caption="Transfer Bus Error Clear" mask="0x01000000" name="ERRCLR"/>
        </register>
        <register caption="Transfer Status Register" name="PERIPH_PTSR" offset="0x24" rw="R" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Receiver Circular Buffer Enable" mask="0x00010000" name="RXCBEN"/>
          <bitfield caption="Transmitter Circular Buffer Enable" mask="0x00040000" name="TXCBEN"/>
          <bitfield caption="Transfer Bus Error" mask="0x01000000" name="ERR"/>
        </register>
        <register caption="Write Protection Mode Register" name="PERIPH_PWPMR" offset="0x28" rw="RW" size="4">
          <bitfield caption="Write Protection Pointer Registers Enable" mask="0x00000001" name="WPPTREN"/>
          <bitfield caption="Write Protection Counter Registers Enable" mask="0x00000002" name="WPCTREN"/>
          <bitfield caption="Write Protection Control Register Enable" mask="0x00000004" name="WPCREN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="PERIPH_PWPMR__WPKEY"/>
        </register>
      </register-group>
      <value-group caption="Write Protection Key" name="PERIPH_PWPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation. Always reads as 0." name="PASSWD" value="0x504443"/>
      </value-group>
    </module>
    <module caption="Parallel Input/Output Controller" name="PIO" id="11264" version="O">
      <register-group name="PIO_GROUP" size="64">
        <register caption="PIO Mask Register" name="PIO_MSKR" offset="0x0" rw="RW" size="4">
          <bitfield caption="PIO Line 0 Mask" mask="0x00000001" name="MSK0" values="PIO_MSKR0__MSK0"/>
          <bitfield caption="PIO Line 1 Mask" mask="0x00000002" name="MSK1" values="PIO_MSKR0__MSK1"/>
          <bitfield caption="PIO Line 2 Mask" mask="0x00000004" name="MSK2" values="PIO_MSKR0__MSK2"/>
          <bitfield caption="PIO Line 3 Mask" mask="0x00000008" name="MSK3" values="PIO_MSKR0__MSK3"/>
          <bitfield caption="PIO Line 4 Mask" mask="0x00000010" name="MSK4" values="PIO_MSKR0__MSK4"/>
          <bitfield caption="PIO Line 5 Mask" mask="0x00000020" name="MSK5" values="PIO_MSKR0__MSK5"/>
          <bitfield caption="PIO Line 6 Mask" mask="0x00000040" name="MSK6" values="PIO_MSKR0__MSK6"/>
          <bitfield caption="PIO Line 7 Mask" mask="0x00000080" name="MSK7" values="PIO_MSKR0__MSK7"/>
          <bitfield caption="PIO Line 8 Mask" mask="0x00000100" name="MSK8" values="PIO_MSKR0__MSK8"/>
          <bitfield caption="PIO Line 9 Mask" mask="0x00000200" name="MSK9" values="PIO_MSKR0__MSK9"/>
          <bitfield caption="PIO Line 10 Mask" mask="0x00000400" name="MSK10" values="PIO_MSKR0__MSK10"/>
          <bitfield caption="PIO Line 11 Mask" mask="0x00000800" name="MSK11" values="PIO_MSKR0__MSK11"/>
          <bitfield caption="PIO Line 12 Mask" mask="0x00001000" name="MSK12" values="PIO_MSKR0__MSK12"/>
          <bitfield caption="PIO Line 13 Mask" mask="0x00002000" name="MSK13" values="PIO_MSKR0__MSK13"/>
          <bitfield caption="PIO Line 14 Mask" mask="0x00004000" name="MSK14" values="PIO_MSKR0__MSK14"/>
          <bitfield caption="PIO Line 15 Mask" mask="0x00008000" name="MSK15" values="PIO_MSKR0__MSK15"/>
          <bitfield caption="PIO Line 16 Mask" mask="0x00010000" name="MSK16" values="PIO_MSKR0__MSK16"/>
          <bitfield caption="PIO Line 17 Mask" mask="0x00020000" name="MSK17" values="PIO_MSKR0__MSK17"/>
          <bitfield caption="PIO Line 18 Mask" mask="0x00040000" name="MSK18" values="PIO_MSKR0__MSK18"/>
          <bitfield caption="PIO Line 19 Mask" mask="0x00080000" name="MSK19" values="PIO_MSKR0__MSK19"/>
          <bitfield caption="PIO Line 20 Mask" mask="0x00100000" name="MSK20" values="PIO_MSKR0__MSK20"/>
          <bitfield caption="PIO Line 21 Mask" mask="0x00200000" name="MSK21" values="PIO_MSKR0__MSK21"/>
          <bitfield caption="PIO Line 22 Mask" mask="0x00400000" name="MSK22" values="PIO_MSKR0__MSK22"/>
          <bitfield caption="PIO Line 23 Mask" mask="0x00800000" name="MSK23" values="PIO_MSKR0__MSK23"/>
          <bitfield caption="PIO Line 24 Mask" mask="0x01000000" name="MSK24" values="PIO_MSKR0__MSK24"/>
          <bitfield caption="PIO Line 25 Mask" mask="0x02000000" name="MSK25" values="PIO_MSKR0__MSK25"/>
          <bitfield caption="PIO Line 26 Mask" mask="0x04000000" name="MSK26" values="PIO_MSKR0__MSK26"/>
          <bitfield caption="PIO Line 27 Mask" mask="0x08000000" name="MSK27" values="PIO_MSKR0__MSK27"/>
          <bitfield caption="PIO Line 28 Mask" mask="0x10000000" name="MSK28" values="PIO_MSKR0__MSK28"/>
          <bitfield caption="PIO Line 29 Mask" mask="0x20000000" name="MSK29" values="PIO_MSKR0__MSK29"/>
          <bitfield caption="PIO Line 30 Mask" mask="0x40000000" name="MSK30" values="PIO_MSKR0__MSK30"/>
          <bitfield caption="PIO Line 31 Mask" mask="0x80000000" name="MSK31" values="PIO_MSKR0__MSK31"/>
        </register>
