Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTSH/atdf/PIC32CX2051MTSH128.atdf
      <value-group caption="I/O Security Status" name="PIO_P_IOSSR0__P8">
        <value caption="The I/O line of the I/O group 0 is in Privileged-Access mode." name="PRIVILEGED_ACCESS" value="0"/>
        <value caption="The I/O line of the I/O group 0 is in User-Access mode." name="USER_ACCESS" value="1"/>
      </value-group>
      <value-group caption="I/O Security Status" name="PIO_P_IOSSR0__P9">
        <value caption="The I/O line of the I/O group 0 is in Privileged-Access mode." name="PRIVILEGED_ACCESS" value="0"/>
        <value caption="The I/O line of the I/O group 0 is in User-Access mode." name="USER_ACCESS" value="1"/>
      </value-group>
      <value-group caption="I/O Security Status" name="PIO_P_IOSSR0__P10">
        <value caption="The I/O line of the I/O group 0 is in Privileged-Access mode." name="PRIVILEGED_ACCESS" value="0"/>
        <value caption="The I/O line of the I/O group 0 is in User-Access mode." name="USER_ACCESS" value="1"/>
      </value-group>
      <value-group caption="I/O Security Status" name="PIO_P_IOSSR0__P11">
        <value caption="The I/O line of the I/O group 0 is in Privileged-Access mode." name="PRIVILEGED_ACCESS" value="0"/>
        <value caption="The I/O line of the I/O group 0 is in User-Access mode." name="USER_ACCESS" value="1"/>
      </value-group>
      <value-group caption="I/O Security Status" name="PIO_P_IOSSR0__P12">
        <value caption="The I/O line of the I/O group 0 is in Privileged-Access mode." name="PRIVILEGED_ACCESS" value="0"/>
        <value caption="The I/O line of the I/O group 0 is in User-Access mode." name="USER_ACCESS" value="1"/>
      </value-group>
      <value-group caption="I/O Security Status" name="PIO_P_IOSSR0__P13">
        <value caption="The I/O line of the I/O group 0 is in Privileged-Access mode." name="PRIVILEGED_ACCESS" value="0"/>
        <value caption="The I/O line of the I/O group 0 is in User-Access mode." name="USER_ACCESS" value="1"/>
      </value-group>
      <value-group caption="I/O Security Status" name="PIO_P_IOSSR0__P14">
        <value caption="The I/O line of the I/O group 0 is in Privileged-Access mode." name="PRIVILEGED_ACCESS" value="0"/>
        <value caption="The I/O line of the I/O group 0 is in User-Access mode." name="USER_ACCESS" value="1"/>
      </value-group>
      <value-group caption="I/O Security Status" name="PIO_P_IOSSR0__P15">
        <value caption="The I/O line of the I/O group 0 is in Privileged-Access mode." name="PRIVILEGED_ACCESS" value="0"/>
        <value caption="The I/O line of the I/O group 0 is in User-Access mode." name="USER_ACCESS" value="1"/>
      </value-group>
      <value-group caption="I/O Security Status" name="PIO_P_IOSSR0__P16">
        <value caption="The I/O line of the I/O group 0 is in Privileged-Access mode." name="PRIVILEGED_ACCESS" value="0"/>
        <value caption="The I/O line of the I/O group 0 is in User-Access mode." name="USER_ACCESS" value="1"/>
      </value-group>
      <value-group caption="I/O Security Status" name="PIO_P_IOSSR0__P17">
        <value caption="The I/O line of the I/O group 0 is in Privileged-Access mode." name="PRIVILEGED_ACCESS" value="0"/>
        <value caption="The I/O line of the I/O group 0 is in User-Access mode." name="USER_ACCESS" value="1"/>
      </value-group>
      <value-group caption="I/O Security Status" name="PIO_P_IOSSR0__P18">
        <value caption="The I/O line of the I/O group 0 is in Privileged-Access mode." name="PRIVILEGED_ACCESS" value="0"/>
        <value caption="The I/O line of the I/O group 0 is in User-Access mode." name="USER_ACCESS" value="1"/>
      </value-group>
      <value-group caption="I/O Security Status" name="PIO_P_IOSSR0__P19">
        <value caption="The I/O line of the I/O group 0 is in Privileged-Access mode." name="PRIVILEGED_ACCESS" value="0"/>
        <value caption="The I/O line of the I/O group 0 is in User-Access mode." name="USER_ACCESS" value="1"/>
      </value-group>
      <value-group caption="I/O Security Status" name="PIO_P_IOSSR0__P20">
        <value caption="The I/O line of the I/O group 0 is in Privileged-Access mode." name="PRIVILEGED_ACCESS" value="0"/>
        <value caption="The I/O line of the I/O group 0 is in User-Access mode." name="USER_ACCESS" value="1"/>
      </value-group>
      <value-group caption="I/O Security Status" name="PIO_P_IOSSR0__P21">
        <value caption="The I/O line of the I/O group 0 is in Privileged-Access mode." name="PRIVILEGED_ACCESS" value="0"/>
        <value caption="The I/O line of the I/O group 0 is in User-Access mode." name="USER_ACCESS" value="1"/>
      </value-group>
      <value-group caption="I/O Security Status" name="PIO_P_IOSSR0__P22">
        <value caption="The I/O line of the I/O group 0 is in Privileged-Access mode." name="PRIVILEGED_ACCESS" value="0"/>
        <value caption="The I/O line of the I/O group 0 is in User-Access mode." name="USER_ACCESS" value="1"/>
      </value-group>
      <value-group caption="I/O Security Status" name="PIO_P_IOSSR0__P23">
        <value caption="The I/O line of the I/O group 0 is in Privileged-Access mode." name="PRIVILEGED_ACCESS" value="0"/>
        <value caption="The I/O line of the I/O group 0 is in User-Access mode." name="USER_ACCESS" value="1"/>
      </value-group>
      <value-group caption="I/O Security Status" name="PIO_P_IOSSR0__P24">
        <value caption="The I/O line of the I/O group 0 is in Privileged-Access mode." name="PRIVILEGED_ACCESS" value="0"/>
        <value caption="The I/O line of the I/O group 0 is in User-Access mode." name="USER_ACCESS" value="1"/>
      </value-group>
      <value-group caption="I/O Security Status" name="PIO_P_IOSSR0__P25">
        <value caption="The I/O line of the I/O group 0 is in Privileged-Access mode." name="PRIVILEGED_ACCESS" value="0"/>
        <value caption="The I/O line of the I/O group 0 is in User-Access mode." name="USER_ACCESS" value="1"/>
      </value-group>
      <value-group caption="I/O Security Status" name="PIO_P_IOSSR0__P26">
        <value caption="The I/O line of the I/O group 0 is in Privileged-Access mode." name="PRIVILEGED_ACCESS" value="0"/>
        <value caption="The I/O line of the I/O group 0 is in User-Access mode." name="USER_ACCESS" value="1"/>
      </value-group>
      <value-group caption="I/O Security Status" name="PIO_P_IOSSR0__P27">
        <value caption="The I/O line of the I/O group 0 is in Privileged-Access mode." name="PRIVILEGED_ACCESS" value="0"/>
        <value caption="The I/O line of the I/O group 0 is in User-Access mode." name="USER_ACCESS" value="1"/>
      </value-group>
      <value-group caption="I/O Security Status" name="PIO_P_IOSSR0__P28">
        <value caption="The I/O line of the I/O group 0 is in Privileged-Access mode." name="PRIVILEGED_ACCESS" value="0"/>
        <value caption="The I/O line of the I/O group 0 is in User-Access mode." name="USER_ACCESS" value="1"/>
      </value-group>
      <value-group caption="I/O Security Status" name="PIO_P_IOSSR0__P29">
        <value caption="The I/O line of the I/O group 0 is in Privileged-Access mode." name="PRIVILEGED_ACCESS" value="0"/>
        <value caption="The I/O line of the I/O group 0 is in User-Access mode." name="USER_ACCESS" value="1"/>
      </value-group>
      <value-group caption="I/O Security Status" name="PIO_P_IOSSR0__P30">
        <value caption="The I/O line of the I/O group 0 is in Privileged-Access mode." name="PRIVILEGED_ACCESS" value="0"/>
        <value caption="The I/O line of the I/O group 0 is in User-Access mode." name="USER_ACCESS" value="1"/>
      </value-group>
