Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTSH/atdf/PIC32CX2051MTSH128.atdf
        <register caption="Fast Start-up Mode Register" name="PMC_FSMR" offset="0x0074" rw="RW" size="4">
          <bitfield caption="RTT Alarm Enable" mask="0x00010000" name="RTTAL"/>
          <bitfield caption="RTC Alarm Enable" mask="0x00020000" name="RTCAL"/>
          <bitfield caption="32KHz Crystal Failure Alarm Enable" mask="0x00040000" name="XTFA"/>
          <bitfield caption="Supply Monitor Alarm Enable" mask="0x00080000" name="SMAL"/>
          <bitfield caption="Low Power Mode" mask="0x00100000" name="LPM"/>
          <bitfield caption="Flash Low-power Mode" mask="0x00600000" name="FLPM" values="PMC_FSMR__FLPM"/>
          <bitfield caption="Force Flash Low-power Mode" mask="0x00800000" name="FFLPM"/>
        </register>
        <register caption="Wake-up Control Register" name="PMC_WCR" offset="0x0078" rw="RW" size="4">
          <bitfield caption="Wake-up Input Number" mask="0x0000000F" name="WKPIONB"/>
          <bitfield caption="Wake-up Input Enable" mask="0x00010000" name="EN"/>
          <bitfield caption="Wake-up Input Polarity" mask="0x00020000" name="WIP"/>
          <bitfield caption="Wake-up Input Enable 1" mask="0x00100000" name="WIEN1"/>
          <bitfield caption="Command" mask="0x01000000" name="CMD"/>
        </register>
        <register caption="Fault Output Clear Register" name="PMC_FOCR" offset="0x007C" rw="W" size="4">
          <bitfield caption="Fault Output Clear" mask="0x00000001" name="FOCLR"/>
        </register>
        <register caption="Coprocessor Fast Start-up Mode Register" name="PMC_CPFSMR" offset="0x0080" rw="RW" size="4">
          <bitfield caption="RTT Alarm Enable" mask="0x00010000" name="RTTAL"/>
          <bitfield caption="RTC Alarm Enable" mask="0x00020000" name="RTCAL"/>
          <bitfield caption="32KHz Crystal Failure Alarm Enable" mask="0x00040000" name="XTFA"/>
          <bitfield caption="Supply Monitor Alarm Enable" mask="0x00080000" name="SMAL"/>
        </register>
        <register caption="Write Protection Mode Register" name="PMC_WPMR" offset="0x0084" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Interrupt Enable" mask="0x00000002" name="WPITEN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="PMC_WPMR__WPKEY"/>
        </register>
        <register caption="Write Protection Status Register" name="PMC_WPSR" offset="0x0088" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protection Violation Source" mask="0x00FFFF00" name="WPVSRC"/>
        </register>
        <register caption="Peripheral Control Register" name="PMC_PCR" offset="0x008C" rw="RW" size="4">
          <bitfield caption="Peripheral ID" mask="0x0000007F" name="PID"/>
          <bitfield caption="Generic Clock Source Selection" mask="0x00001F00" name="GCLKCSS" values="PMC_PCR__GCLKCSS"/>
          <bitfield caption="Master Clock Index (Read-only)" mask="0x000F0000" name="MCKID"/>
          <bitfield caption="Generic Clock Division Ratio" mask="0x0FF00000" name="GCLKDIV"/>
          <bitfield caption="Enable" mask="0x10000000" name="EN"/>
          <bitfield caption="Generic Clock Enable" mask="0x20000000" name="GCLKEN"/>
          <bitfield caption="Command" mask="0x80000000" name="CMD"/>
        </register>
        <register caption="Oscillator Calibration Register" name="PMC_OCR" offset="0x0090" rw="RW" size="4">
          <bitfield caption="Main RC Oscillator Calibration Bits" mask="0x007F0000" name="CAL12"/>
          <bitfield caption="Selection of Main RC Oscillator Calibration Bits" mask="0x00800000" name="SEL12"/>
        </register>
        <register caption="Partial Wake-up Activity In Progress Register" name="PMC_SLPWK_AIPR" offset="0x0094" rw="R" size="4">
          <bitfield caption="Activity In Progress" mask="0x00000001" name="AIP"/>
        </register>
        <register caption="Partial Wake-up Control Register" name="PMC_SLPWKCR" offset="0x0098" rw="RW" size="4">
          <bitfield caption="Peripheral ID" mask="0x0000007F" name="PID"/>
          <bitfield caption="Command" mask="0x00001000" name="CMD"/>
          <bitfield caption="Activity Status Register" mask="0x00010000" name="ASR"/>
          <bitfield caption="Partial Wake-up Sleep Register" mask="0x10000000" name="SLPWKSR"/>
        </register>
        <register caption="MCK0 Monitor Limits Register" name="PMC_MCKLIM" offset="0x00A0" rw="RW" size="4">
          <bitfield caption="MCK0 Monitoring Low IT Limit" mask="0x000000FF" name="MCK_LOW_IT"/>
          <bitfield caption="MCK0 Monitoring High IT Limit" mask="0x0000FF00" name="MCK_HIGH_IT"/>
          <bitfield caption="MCK0 Monitoring Low RESET Limit" mask="0x00FF0000" name="MCK_LOW_RES"/>
          <bitfield caption="MCK0 Monitoring High Reset Limit" mask="0xFF000000" name="MCK_HIGH_RES"/>
        </register>
        <register caption="Peripheral Clock Status Register 0" name="PMC_CSR0" offset="0x00A4" rw="R" size="4">
          <bitfield caption="Peripheral Clock 9 Status" mask="0x00000200" name="PID9"/>
          <bitfield caption="Peripheral Clock 10 Status" mask="0x00000400" name="PID10"/>
          <bitfield caption="Peripheral Clock 11 Status" mask="0x00000800" name="PID11"/>
          <bitfield caption="Peripheral Clock 12 Status" mask="0x00001000" name="PID12"/>
          <bitfield caption="Peripheral Clock 13 Status" mask="0x00002000" name="PID13"/>
          <bitfield caption="Peripheral Clock 14 Status" mask="0x00004000" name="PID14"/>
          <bitfield caption="Peripheral Clock 15 Status" mask="0x00008000" name="PID15"/>
          <bitfield caption="Peripheral Clock 16 Status" mask="0x00010000" name="PID16"/>
          <bitfield caption="Peripheral Clock 17 Status" mask="0x00020000" name="PID17"/>
          <bitfield caption="Peripheral Clock 23 Status" mask="0x00800000" name="PID23"/>
          <bitfield caption="Peripheral Clock 24 Status" mask="0x01000000" name="PID24"/>
          <bitfield caption="Peripheral Clock 25 Status" mask="0x02000000" name="PID25"/>
          <bitfield caption="Peripheral Clock 28 Status" mask="0x10000000" name="PID28"/>
          <bitfield caption="Peripheral Clock 30 Status" mask="0x40000000" name="PID30"/>
          <bitfield caption="Peripheral Clock 31 Status" mask="0x80000000" name="PID31"/>
        </register>
        <register caption="Peripheral Clock Status Register 1" name="PMC_CSR1" offset="0x00A8" rw="R" size="4">
          <bitfield caption="Peripheral Clock 32 Status" mask="0x00000001" name="PID32"/>
          <bitfield caption="Peripheral Clock 33 Status" mask="0x00000002" name="PID33"/>
          <bitfield caption="Peripheral Clock 34 Status" mask="0x00000004" name="PID34"/>
          <bitfield caption="Peripheral Clock 35 Status" mask="0x00000008" name="PID35"/>
          <bitfield caption="Peripheral Clock 36 Status" mask="0x00000010" name="PID36"/>
          <bitfield caption="Peripheral Clock 37 Status" mask="0x00000020" name="PID37"/>
          <bitfield caption="Peripheral Clock 38 Status" mask="0x00000040" name="PID38"/>
          <bitfield caption="Peripheral Clock 39 Status" mask="0x00000080" name="PID39"/>
          <bitfield caption="Peripheral Clock 49 Status" mask="0x00020000" name="PID49"/>
          <bitfield caption="Peripheral Clock 51 Status" mask="0x00080000" name="PID51"/>
          <bitfield caption="Peripheral Clock 53 Status" mask="0x00200000" name="PID53"/>
          <bitfield caption="Peripheral Clock 55 Status" mask="0x00800000" name="PID55"/>
          <bitfield caption="Peripheral Clock 57 Status" mask="0x02000000" name="PID57"/>
          <bitfield caption="Peripheral Clock 59 Status" mask="0x08000000" name="PID59"/>
        </register>
        <register caption="Peripheral Clock Status Register 2" name="PMC_CSR2" offset="0x00AC" rw="R" size="4">
          <bitfield caption="Peripheral Clock 75 Status" mask="0x00000800" name="PID75"/>
          <bitfield caption="Peripheral Clock 78 Status" mask="0x00004000" name="PID78"/>
          <bitfield caption="Peripheral Clock 79 Status" mask="0x00008000" name="PID79"/>
          <bitfield caption="Peripheral Clock 80 Status" mask="0x00010000" name="PID80"/>
          <bitfield caption="Peripheral Clock 81 Status" mask="0x00020000" name="PID81"/>
          <bitfield caption="Peripheral Clock 85 Status" mask="0x00200000" name="PID85"/>
          <bitfield caption="Peripheral Clock 87 Status" mask="0x00800000" name="PID87"/>
          <bitfield caption="Peripheral Clock 88 Status" mask="0x01000000" name="PID88"/>
          <bitfield caption="Peripheral Clock 89 Status" mask="0x02000000" name="PID89"/>
          <bitfield caption="Peripheral Clock 90 Status" mask="0x04000000" name="PID90"/>
          <bitfield caption="Peripheral Clock 91 Status" mask="0x08000000" name="PID91"/>
        </register>
