Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTSH/atdf/PIC32CX2051MTSH128.atdf
    <module caption="Segment LCD Controller" name="SLCDC" id="6259" version="K">
      <register-group name="SLCDC">
        <register caption="Control Register" name="SLCDC_CR" offset="0x0" rw="W" size="4">
          <bitfield caption="Enable the LCDC" mask="0x00000001" name="LCDEN"/>
          <bitfield caption="Disable LCDC" mask="0x00000002" name="LCDDIS"/>
          <bitfield caption="Software Reset" mask="0x00000008" name="SWRST"/>
          <bitfield caption="Freeze Display Panel Features Configuration" mask="0x00000040" name="FRZDF"/>
          <bitfield caption="Freeze Remap Configuration" mask="0x00000080" name="FRZMAP"/>
          <bitfield caption="Freeze Key (write-only)" mask="0x0000FF00" name="FRZKEY" values="SLCDC_CR__FRZKEY"/>
        </register>
        <register caption="Mode Register" name="SLCDC_MR" offset="0x4" rw="RW" size="4">
          <bitfield caption="Selection of the Number of Commons" mask="0x00000007" name="COMSEL" values="SLCDC_MR__COMSEL"/>
          <bitfield caption="Selection of the Number of Segments" mask="0x00003F00" name="SEGSEL"/>
          <bitfield caption="Buffer On-Time" mask="0x000F0000" name="BUFTIME" values="SLCDC_MR__BUFTIME"/>
          <bitfield caption="LCD Display Configuration" mask="0x00300000" name="BIAS" values="SLCDC_MR__BIAS"/>
          <bitfield caption="Low-Power Mode" mask="0x01000000" name="LPMODE"/>
        </register>
        <register caption="Frame Rate Register" name="SLCDC_FRR" offset="0x8" rw="RW" size="4">
          <bitfield caption="Clock Prescaler" mask="0x00000007" name="PRESC" values="SLCDC_FRR__PRESC"/>
          <bitfield caption="Clock Division" mask="0x00000700" name="DIV" values="SLCDC_FRR__DIV"/>
        </register>
        <register caption="Display Register" name="SLCDC_DR" offset="0xC" rw="RW" size="4">
          <bitfield caption="Display Mode Register" mask="0x00000007" name="DISPMODE" values="SLCDC_DR__DISPMODE"/>
          <bitfield caption="LCD Blinking Frequency Selection" mask="0x0000FF00" name="LCDBLKFREQ"/>
        </register>
        <register caption="Status Register" name="SLCDC_SR" offset="0x10" rw="R" size="4">
          <bitfield caption="Enable Status (Automatically Set/Reset)" mask="0x00000001" name="ENA"/>
          <bitfield caption="Display Panel Features Configuration Freeze Status" mask="0x00000040" name="DFFRZS"/>
          <bitfield caption="Remapping Configuration Freeze Status" mask="0x00000080" name="MAPFRZS"/>
        </register>
        <register caption="Interrupt Enable Register" name="SLCDC_IER" offset="0x20" rw="W" size="4">
          <bitfield caption="End of Frame Interrupt Enable" mask="0x00000001" name="ENDFRAME"/>
          <bitfield caption="Disable Completion Interrupt Enable" mask="0x00000004" name="DIS"/>
        </register>
        <register caption="Interrupt Disable Register" name="SLCDC_IDR" offset="0x24" rw="W" size="4">
          <bitfield caption="End of Frame Interrupt Disable" mask="0x00000001" name="ENDFRAME"/>
          <bitfield caption="Disable Completion Interrupt Disable" mask="0x00000004" name="DIS"/>
        </register>
        <register caption="Interrupt Mask Register" name="SLCDC_IMR" offset="0x28" rw="R" size="4">
          <bitfield caption="End of Frame Interrupt Mask" mask="0x00000001" name="ENDFRAME"/>
          <bitfield caption="Disable Completion Interrupt Mask" mask="0x00000004" name="DIS"/>
        </register>
        <register caption="Interrupt Status Register" name="SLCDC_ISR" offset="0x2C" rw="R" size="4">
          <bitfield caption="End of Frame Interrupt Status" mask="0x00000001" name="ENDFRAME"/>
          <bitfield caption="Disable Completion Interrupt Status" mask="0x00000004" name="DIS"/>
        </register>
        <register caption="Segment Map Register 0" name="SLCDC_SMR0" offset="0x30" rw="RW" size="4">
          <bitfield caption="LCD Segment Mapped on SEGx I/O Pin" mask="0x00000001" name="LCD0"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O Pin" mask="0x00000002" name="LCD1"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O Pin" mask="0x00000004" name="LCD2"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O Pin" mask="0x00000008" name="LCD3"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O Pin" mask="0x00000010" name="LCD4"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O Pin" mask="0x00000020" name="LCD5"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O Pin" mask="0x00000040" name="LCD6"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O Pin" mask="0x00000080" name="LCD7"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O Pin" mask="0x00000100" name="LCD8"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O Pin" mask="0x00000200" name="LCD9"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O Pin" mask="0x00000400" name="LCD10"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O Pin" mask="0x00000800" name="LCD11"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O Pin" mask="0x00001000" name="LCD12"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O Pin" mask="0x00002000" name="LCD13"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O Pin" mask="0x00004000" name="LCD14"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O Pin" mask="0x00008000" name="LCD15"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O Pin" mask="0x00010000" name="LCD16"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O Pin" mask="0x00020000" name="LCD17"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O Pin" mask="0x00040000" name="LCD18"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O Pin" mask="0x00080000" name="LCD19"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O Pin" mask="0x00100000" name="LCD20"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O Pin" mask="0x00200000" name="LCD21"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O Pin" mask="0x00400000" name="LCD22"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O Pin" mask="0x00800000" name="LCD23"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O Pin" mask="0x01000000" name="LCD24"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O Pin" mask="0x02000000" name="LCD25"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O Pin" mask="0x04000000" name="LCD26"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O Pin" mask="0x08000000" name="LCD27"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O Pin" mask="0x10000000" name="LCD28"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O Pin" mask="0x20000000" name="LCD29"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O Pin" mask="0x40000000" name="LCD30"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O Pin" mask="0x80000000" name="LCD31"/>
        </register>
