Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTSH/atdf/PIC32CX2051MTSH128.atdf
      <value-group caption="UART Receive Data Inverted" name="UART_MR__OPT_RXINV">
        <value caption="The comparator data output is not inverted before entering UART." name="DISABLED" value="0"/>
        <value caption="The comparator data output is inverted before entering UART." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="UART Modulated Data Inverted" name="UART_MR__OPT_MDINV">
        <value caption="The output of the modulator is not inverted." name="DISABLED" value="0"/>
        <value caption="The output of the modulator is inverted." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Optical Demodulation Enable" name="UART_MR__OPT_DMOD">
        <value caption="The optical demodulator is disabled. External demodulation must be enabled." name="DISABLED" value="0"/>
        <value caption="The optical demodulator is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Receiver Digital Filter" name="UART_MR__FILTER">
        <value caption="UART does not filter the receive line." name="DISABLED" value="0"/>
        <value caption="UART filters the receive line using a three-sample filter (16x-bit clock) (2 over 3 majority)." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Analog Comparator Enable" name="UART_MR__ACON">
        <value caption="The analog comparator is disabled. If OPT_EN=1, the analog comparator is enabled." name="DISABLED" value="0"/>
        <value caption="The analog comparator is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Analog Comparator Output Edge Selection" name="UART_MR__EDGESEL">
        <value caption="The UART_SR.ACE is set if a rising edge is detected on analog comparator output." name="RISING" value="0x0"/>
        <value caption="The UART_SR.ACE is set if a falling edge is detected on analog comparator output." name="FALLING" value="0x1"/>
        <value caption="The UART_SR.ACE is set as soon as an edge is detected on analog comparator output." name="ANY_EDGE" value="0x2"/>
      </value-group>
      <value-group caption="Optical Link Activity Wake-up Enable" name="UART_MR__OPT_WKUP">
        <value caption="To detect any activity on the output of analog comparator, the clock is always active and OPT_EN must be written to 1.." name="DISABLED" value="0"/>
        <value caption="If OPT_EN=0 and a logical 1 is detected after inversion (if RXINV=1) on analog comparator output, the clock if automatically enabled for all UART sub-modules. After a period of inactivity on URXD (time-out) the software can instruct the UART to disabled the clock of all sub-modules to reduce power consumption by applying the UART_CR.OPT_SLEEP command." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Parity Type" name="UART_MR__PAR">
        <value caption="Even Parity" name="EVEN" value="0x0"/>
        <value caption="Odd Parity" name="ODD" value="0x1"/>
        <value caption="Space: parity forced to 0" name="SPACE" value="0x2"/>
        <value caption="Mark: parity forced to 1" name="MARK" value="0x3"/>
        <value caption="No parity" name="NO" value="0x4"/>
      </value-group>
      <value-group caption="Baud Rate Source Clock" name="UART_MR__BRSRCCK">
        <value caption="The baud rate is driven by the peripheral clock" name="PERIPH_CLK" value="0"/>
        <value caption="The baud rate is driven by a PMC-programmable clock GCLK (see the section &quot;Power Management Controller (PMC)&quot;)." name="GCLK" value="1"/>
      </value-group>
      <value-group caption="Channel Mode" name="UART_MR__CHMODE">
        <value caption="Normal mode" name="NORMAL" value="0x0"/>
        <value caption="Automatic echo" name="AUTOMATIC" value="0x1"/>
        <value caption="Local loopback" name="LOCAL_LOOPBACK" value="0x2"/>
        <value caption="Remote loopback" name="REMOTE_LOOPBACK" value="0x3"/>
      </value-group>
      <value-group caption="Optical Link Modulation Clock Duty Cycle" name="UART_MR__OPT_DUTY">
        <value caption="Modulation clock duty cycle Is 50%." name="DUTY_50" value="0x0"/>
        <value caption="Modulation clock duty cycle Is 43.75%." name="DUTY_43P75" value="0x1"/>
        <value caption="Modulation clock duty cycle Is 37.5%." name="DUTY_37P5" value="0x2"/>
        <value caption="Modulation clock duty cycle Is 31.75%." name="DUTY_31P25" value="0x3"/>
        <value caption="Modulation clock duty cycle Is 25%." name="DUTY_25" value="0x4"/>
        <value caption="Modulation clock duty cycle Is 18.75%." name="DUTY_18P75" value="0x5"/>
        <value caption="Modulation clock duty cycle Is 12.5%." name="DUTY_12P5" value="0x6"/>
        <value caption="Modulation clock duty cycle Is 6.25%." name="DUTY_6P25" value="0x7"/>
      </value-group>
      <value-group caption="Receive Path Comparator Threshold" name="UART_MR__OPT_CMPTH">
        <value caption="Comparator threshold is VDD3V3/2 volts." name="VDD3V3_DIV2" value="0x0"/>
        <value caption="Comparator threshold is VDD3V3/2.5 volts." name="VDD3V3_DIV2P5" value="0x1"/>
        <value caption="Comparator threshold is VDD3V3/3.3 volts." name="VDD3V3_DIV3P3" value="0x2"/>
        <value caption="Comparator threshold is VDD3V3/5 volts." name="VDD3V3_DIV5" value="0x3"/>
        <value caption="Comparator threshold is VDD3V3/10 volts." name="VDD3V3_DIV10" value="0x4"/>
      </value-group>
      <value-group caption="Comparison Mode" name="UART_CMPR__CMPMODE">
        <value caption="Any character is received and comparison function drives CMP flag." name="FLAG_ONLY" value="0"/>
        <value caption="Comparison condition must be met to start reception." name="START_CONDITION" value="1"/>
      </value-group>
      <value-group caption="Write Protection Key" name="UART_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation. Always reads as 0." name="PASSWD" value="0x554152"/>
      </value-group>
