Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTSH/atdf/PIC32CX2051MTSH128.atdf
        <register caption="Lock Bits Word 10" name="LOCKBIT_WORD10" offset="0x28" rw="RW" size="4">
          <bitfield caption="Lock Region 320" mask="0x00000001" name="LOCK_REGION_320"/>
          <bitfield caption="Lock Region 321" mask="0x00000002" name="LOCK_REGION_321"/>
          <bitfield caption="Lock Region 322" mask="0x00000004" name="LOCK_REGION_322"/>
          <bitfield caption="Lock Region 323" mask="0x00000008" name="LOCK_REGION_323"/>
          <bitfield caption="Lock Region 324" mask="0x00000010" name="LOCK_REGION_324"/>
          <bitfield caption="Lock Region 325" mask="0x00000020" name="LOCK_REGION_325"/>
          <bitfield caption="Lock Region 326" mask="0x00000040" name="LOCK_REGION_326"/>
          <bitfield caption="Lock Region 327" mask="0x00000080" name="LOCK_REGION_327"/>
          <bitfield caption="Lock Region 328" mask="0x00000100" name="LOCK_REGION_328"/>
          <bitfield caption="Lock Region 329" mask="0x00000200" name="LOCK_REGION_329"/>
          <bitfield caption="Lock Region 330" mask="0x00000400" name="LOCK_REGION_330"/>
          <bitfield caption="Lock Region 331" mask="0x00000800" name="LOCK_REGION_331"/>
          <bitfield caption="Lock Region 332" mask="0x00001000" name="LOCK_REGION_332"/>
          <bitfield caption="Lock Region 333" mask="0x00002000" name="LOCK_REGION_333"/>
          <bitfield caption="Lock Region 334" mask="0x00004000" name="LOCK_REGION_334"/>
          <bitfield caption="Lock Region 335" mask="0x00008000" name="LOCK_REGION_335"/>
          <bitfield caption="Lock Region 336" mask="0x00010000" name="LOCK_REGION_336"/>
          <bitfield caption="Lock Region 337" mask="0x00020000" name="LOCK_REGION_337"/>
          <bitfield caption="Lock Region 338" mask="0x00040000" name="LOCK_REGION_338"/>
          <bitfield caption="Lock Region 339" mask="0x00080000" name="LOCK_REGION_339"/>
          <bitfield caption="Lock Region 340" mask="0x00100000" name="LOCK_REGION_340"/>
          <bitfield caption="Lock Region 341" mask="0x00200000" name="LOCK_REGION_341"/>
          <bitfield caption="Lock Region 342" mask="0x00400000" name="LOCK_REGION_342"/>
          <bitfield caption="Lock Region 343" mask="0x00800000" name="LOCK_REGION_343"/>
          <bitfield caption="Lock Region 344" mask="0x01000000" name="LOCK_REGION_344"/>
          <bitfield caption="Lock Region 345" mask="0x02000000" name="LOCK_REGION_345"/>
          <bitfield caption="Lock Region 346" mask="0x04000000" name="LOCK_REGION_346"/>
          <bitfield caption="Lock Region 347" mask="0x08000000" name="LOCK_REGION_347"/>
          <bitfield caption="Lock Region 348" mask="0x10000000" name="LOCK_REGION_348"/>
          <bitfield caption="Lock Region 349" mask="0x20000000" name="LOCK_REGION_349"/>
          <bitfield caption="Lock Region 350" mask="0x40000000" name="LOCK_REGION_350"/>
          <bitfield caption="Lock Region 351" mask="0x80000000" name="LOCK_REGION_351"/>
        </register>
        <register caption="Lock Bits Word 11" name="LOCKBIT_WORD11" offset="0x2C" rw="RW" size="4">
          <bitfield caption="Lock Region 352" mask="0x00000001" name="LOCK_REGION_352"/>
          <bitfield caption="Lock Region 353" mask="0x00000002" name="LOCK_REGION_353"/>
          <bitfield caption="Lock Region 354" mask="0x00000004" name="LOCK_REGION_354"/>
          <bitfield caption="Lock Region 355" mask="0x00000008" name="LOCK_REGION_355"/>
          <bitfield caption="Lock Region 356" mask="0x00000010" name="LOCK_REGION_356"/>
          <bitfield caption="Lock Region 357" mask="0x00000020" name="LOCK_REGION_357"/>
          <bitfield caption="Lock Region 358" mask="0x00000040" name="LOCK_REGION_358"/>
          <bitfield caption="Lock Region 359" mask="0x00000080" name="LOCK_REGION_359"/>
          <bitfield caption="Lock Region 360" mask="0x00000100" name="LOCK_REGION_360"/>
          <bitfield caption="Lock Region 361" mask="0x00000200" name="LOCK_REGION_361"/>
          <bitfield caption="Lock Region 362" mask="0x00000400" name="LOCK_REGION_362"/>
          <bitfield caption="Lock Region 363" mask="0x00000800" name="LOCK_REGION_363"/>
          <bitfield caption="Lock Region 364" mask="0x00001000" name="LOCK_REGION_364"/>
          <bitfield caption="Lock Region 365" mask="0x00002000" name="LOCK_REGION_365"/>
          <bitfield caption="Lock Region 366" mask="0x00004000" name="LOCK_REGION_366"/>
          <bitfield caption="Lock Region 367" mask="0x00008000" name="LOCK_REGION_367"/>
          <bitfield caption="Lock Region 368" mask="0x00010000" name="LOCK_REGION_368"/>
          <bitfield caption="Lock Region 369" mask="0x00020000" name="LOCK_REGION_369"/>
          <bitfield caption="Lock Region 370" mask="0x00040000" name="LOCK_REGION_370"/>
          <bitfield caption="Lock Region 371" mask="0x00080000" name="LOCK_REGION_371"/>
          <bitfield caption="Lock Region 372" mask="0x00100000" name="LOCK_REGION_372"/>
          <bitfield caption="Lock Region 373" mask="0x00200000" name="LOCK_REGION_373"/>
          <bitfield caption="Lock Region 374" mask="0x00400000" name="LOCK_REGION_374"/>
          <bitfield caption="Lock Region 375" mask="0x00800000" name="LOCK_REGION_375"/>
          <bitfield caption="Lock Region 376" mask="0x01000000" name="LOCK_REGION_376"/>
          <bitfield caption="Lock Region 377" mask="0x02000000" name="LOCK_REGION_377"/>
          <bitfield caption="Lock Region 378" mask="0x04000000" name="LOCK_REGION_378"/>
          <bitfield caption="Lock Region 379" mask="0x08000000" name="LOCK_REGION_379"/>
          <bitfield caption="Lock Region 380" mask="0x10000000" name="LOCK_REGION_380"/>
          <bitfield caption="Lock Region 381" mask="0x20000000" name="LOCK_REGION_381"/>
          <bitfield caption="Lock Region 382" mask="0x40000000" name="LOCK_REGION_382"/>
          <bitfield caption="Lock Region 383" mask="0x80000000" name="LOCK_REGION_383"/>
        </register>
        <register caption="Lock Bits Word 12" name="LOCKBIT_WORD12" offset="0x30" rw="RW" size="4">
          <bitfield caption="Lock Region 384" mask="0x00000001" name="LOCK_REGION_384"/>
          <bitfield caption="Lock Region 385" mask="0x00000002" name="LOCK_REGION_385"/>
          <bitfield caption="Lock Region 386" mask="0x00000004" name="LOCK_REGION_386"/>
          <bitfield caption="Lock Region 387" mask="0x00000008" name="LOCK_REGION_387"/>
          <bitfield caption="Lock Region 388" mask="0x00000010" name="LOCK_REGION_388"/>
          <bitfield caption="Lock Region 389" mask="0x00000020" name="LOCK_REGION_389"/>
          <bitfield caption="Lock Region 390" mask="0x00000040" name="LOCK_REGION_390"/>
          <bitfield caption="Lock Region 391" mask="0x00000080" name="LOCK_REGION_391"/>
          <bitfield caption="Lock Region 392" mask="0x00000100" name="LOCK_REGION_392"/>
          <bitfield caption="Lock Region 393" mask="0x00000200" name="LOCK_REGION_393"/>
          <bitfield caption="Lock Region 394" mask="0x00000400" name="LOCK_REGION_394"/>
          <bitfield caption="Lock Region 395" mask="0x00000800" name="LOCK_REGION_395"/>
          <bitfield caption="Lock Region 396" mask="0x00001000" name="LOCK_REGION_396"/>
          <bitfield caption="Lock Region 397" mask="0x00002000" name="LOCK_REGION_397"/>
          <bitfield caption="Lock Region 398" mask="0x00004000" name="LOCK_REGION_398"/>
          <bitfield caption="Lock Region 399" mask="0x00008000" name="LOCK_REGION_399"/>
          <bitfield caption="Lock Region 400" mask="0x00010000" name="LOCK_REGION_400"/>
          <bitfield caption="Lock Region 401" mask="0x00020000" name="LOCK_REGION_401"/>
          <bitfield caption="Lock Region 402" mask="0x00040000" name="LOCK_REGION_402"/>
          <bitfield caption="Lock Region 403" mask="0x00080000" name="LOCK_REGION_403"/>
          <bitfield caption="Lock Region 404" mask="0x00100000" name="LOCK_REGION_404"/>
          <bitfield caption="Lock Region 405" mask="0x00200000" name="LOCK_REGION_405"/>
          <bitfield caption="Lock Region 406" mask="0x00400000" name="LOCK_REGION_406"/>
          <bitfield caption="Lock Region 407" mask="0x00800000" name="LOCK_REGION_407"/>
          <bitfield caption="Lock Region 408" mask="0x01000000" name="LOCK_REGION_408"/>
          <bitfield caption="Lock Region 409" mask="0x02000000" name="LOCK_REGION_409"/>
          <bitfield caption="Lock Region 410" mask="0x04000000" name="LOCK_REGION_410"/>
          <bitfield caption="Lock Region 411" mask="0x08000000" name="LOCK_REGION_411"/>
          <bitfield caption="Lock Region 412" mask="0x10000000" name="LOCK_REGION_412"/>
          <bitfield caption="Lock Region 413" mask="0x20000000" name="LOCK_REGION_413"/>
          <bitfield caption="Lock Region 414" mask="0x40000000" name="LOCK_REGION_414"/>
          <bitfield caption="Lock Region 415" mask="0x80000000" name="LOCK_REGION_415"/>
        </register>
