Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTSH/atdf/PIC32CX2051MTSH128.atdf
        <register caption="Lock Bits Word 13" name="LOCKBIT_WORD13" offset="0x34" rw="RW" size="4">
          <bitfield caption="Lock Region 416" mask="0x00000001" name="LOCK_REGION_416"/>
          <bitfield caption="Lock Region 417" mask="0x00000002" name="LOCK_REGION_417"/>
          <bitfield caption="Lock Region 418" mask="0x00000004" name="LOCK_REGION_418"/>
          <bitfield caption="Lock Region 419" mask="0x00000008" name="LOCK_REGION_419"/>
          <bitfield caption="Lock Region 420" mask="0x00000010" name="LOCK_REGION_420"/>
          <bitfield caption="Lock Region 421" mask="0x00000020" name="LOCK_REGION_421"/>
          <bitfield caption="Lock Region 422" mask="0x00000040" name="LOCK_REGION_422"/>
          <bitfield caption="Lock Region 423" mask="0x00000080" name="LOCK_REGION_423"/>
          <bitfield caption="Lock Region 424" mask="0x00000100" name="LOCK_REGION_424"/>
          <bitfield caption="Lock Region 425" mask="0x00000200" name="LOCK_REGION_425"/>
          <bitfield caption="Lock Region 426" mask="0x00000400" name="LOCK_REGION_426"/>
          <bitfield caption="Lock Region 427" mask="0x00000800" name="LOCK_REGION_427"/>
          <bitfield caption="Lock Region 428" mask="0x00001000" name="LOCK_REGION_428"/>
          <bitfield caption="Lock Region 429" mask="0x00002000" name="LOCK_REGION_429"/>
          <bitfield caption="Lock Region 430" mask="0x00004000" name="LOCK_REGION_430"/>
          <bitfield caption="Lock Region 431" mask="0x00008000" name="LOCK_REGION_431"/>
          <bitfield caption="Lock Region 432" mask="0x00010000" name="LOCK_REGION_432"/>
          <bitfield caption="Lock Region 433" mask="0x00020000" name="LOCK_REGION_433"/>
          <bitfield caption="Lock Region 434" mask="0x00040000" name="LOCK_REGION_434"/>
          <bitfield caption="Lock Region 435" mask="0x00080000" name="LOCK_REGION_435"/>
          <bitfield caption="Lock Region 436" mask="0x00100000" name="LOCK_REGION_436"/>
          <bitfield caption="Lock Region 437" mask="0x00200000" name="LOCK_REGION_437"/>
          <bitfield caption="Lock Region 438" mask="0x00400000" name="LOCK_REGION_438"/>
          <bitfield caption="Lock Region 439" mask="0x00800000" name="LOCK_REGION_439"/>
          <bitfield caption="Lock Region 440" mask="0x01000000" name="LOCK_REGION_440"/>
          <bitfield caption="Lock Region 441" mask="0x02000000" name="LOCK_REGION_441"/>
          <bitfield caption="Lock Region 442" mask="0x04000000" name="LOCK_REGION_442"/>
          <bitfield caption="Lock Region 443" mask="0x08000000" name="LOCK_REGION_443"/>
          <bitfield caption="Lock Region 444" mask="0x10000000" name="LOCK_REGION_444"/>
          <bitfield caption="Lock Region 445" mask="0x20000000" name="LOCK_REGION_445"/>
          <bitfield caption="Lock Region 446" mask="0x40000000" name="LOCK_REGION_446"/>
          <bitfield caption="Lock Region 447" mask="0x80000000" name="LOCK_REGION_447"/>
        </register>
        <register caption="Lock Bits Word 14" name="LOCKBIT_WORD14" offset="0x38" rw="RW" size="4">
          <bitfield caption="Lock Region 448" mask="0x00000001" name="LOCK_REGION_448"/>
          <bitfield caption="Lock Region 449" mask="0x00000002" name="LOCK_REGION_449"/>
          <bitfield caption="Lock Region 450" mask="0x00000004" name="LOCK_REGION_450"/>
          <bitfield caption="Lock Region 451" mask="0x00000008" name="LOCK_REGION_451"/>
          <bitfield caption="Lock Region 452" mask="0x00000010" name="LOCK_REGION_452"/>
          <bitfield caption="Lock Region 453" mask="0x00000020" name="LOCK_REGION_453"/>
          <bitfield caption="Lock Region 454" mask="0x00000040" name="LOCK_REGION_454"/>
          <bitfield caption="Lock Region 455" mask="0x00000080" name="LOCK_REGION_455"/>
          <bitfield caption="Lock Region 456" mask="0x00000100" name="LOCK_REGION_456"/>
          <bitfield caption="Lock Region 457" mask="0x00000200" name="LOCK_REGION_457"/>
          <bitfield caption="Lock Region 458" mask="0x00000400" name="LOCK_REGION_458"/>
          <bitfield caption="Lock Region 459" mask="0x00000800" name="LOCK_REGION_459"/>
          <bitfield caption="Lock Region 460" mask="0x00001000" name="LOCK_REGION_460"/>
          <bitfield caption="Lock Region 461" mask="0x00002000" name="LOCK_REGION_461"/>
          <bitfield caption="Lock Region 462" mask="0x00004000" name="LOCK_REGION_462"/>
          <bitfield caption="Lock Region 463" mask="0x00008000" name="LOCK_REGION_463"/>
          <bitfield caption="Lock Region 464" mask="0x00010000" name="LOCK_REGION_464"/>
          <bitfield caption="Lock Region 465" mask="0x00020000" name="LOCK_REGION_465"/>
          <bitfield caption="Lock Region 466" mask="0x00040000" name="LOCK_REGION_466"/>
          <bitfield caption="Lock Region 467" mask="0x00080000" name="LOCK_REGION_467"/>
          <bitfield caption="Lock Region 468" mask="0x00100000" name="LOCK_REGION_468"/>
          <bitfield caption="Lock Region 469" mask="0x00200000" name="LOCK_REGION_469"/>
          <bitfield caption="Lock Region 470" mask="0x00400000" name="LOCK_REGION_470"/>
          <bitfield caption="Lock Region 471" mask="0x00800000" name="LOCK_REGION_471"/>
          <bitfield caption="Lock Region 472" mask="0x01000000" name="LOCK_REGION_472"/>
          <bitfield caption="Lock Region 473" mask="0x02000000" name="LOCK_REGION_473"/>
          <bitfield caption="Lock Region 474" mask="0x04000000" name="LOCK_REGION_474"/>
          <bitfield caption="Lock Region 475" mask="0x08000000" name="LOCK_REGION_475"/>
          <bitfield caption="Lock Region 476" mask="0x10000000" name="LOCK_REGION_476"/>
          <bitfield caption="Lock Region 477" mask="0x20000000" name="LOCK_REGION_477"/>
          <bitfield caption="Lock Region 478" mask="0x40000000" name="LOCK_REGION_478"/>
          <bitfield caption="Lock Region 479" mask="0x80000000" name="LOCK_REGION_479"/>
        </register>
        <register caption="Lock Bits Word 15" name="LOCKBIT_WORD15" offset="0x3C" rw="RW" size="4">
          <bitfield caption="Lock Region 480" mask="0x00000001" name="LOCK_REGION_480"/>
          <bitfield caption="Lock Region 481" mask="0x00000002" name="LOCK_REGION_481"/>
          <bitfield caption="Lock Region 482" mask="0x00000004" name="LOCK_REGION_482"/>
          <bitfield caption="Lock Region 483" mask="0x00000008" name="LOCK_REGION_483"/>
          <bitfield caption="Lock Region 484" mask="0x00000010" name="LOCK_REGION_484"/>
          <bitfield caption="Lock Region 485" mask="0x00000020" name="LOCK_REGION_485"/>
          <bitfield caption="Lock Region 486" mask="0x00000040" name="LOCK_REGION_486"/>
          <bitfield caption="Lock Region 487" mask="0x00000080" name="LOCK_REGION_487"/>
          <bitfield caption="Lock Region 488" mask="0x00000100" name="LOCK_REGION_488"/>
          <bitfield caption="Lock Region 489" mask="0x00000200" name="LOCK_REGION_489"/>
          <bitfield caption="Lock Region 490" mask="0x00000400" name="LOCK_REGION_490"/>
          <bitfield caption="Lock Region 491" mask="0x00000800" name="LOCK_REGION_491"/>
          <bitfield caption="Lock Region 492" mask="0x00001000" name="LOCK_REGION_492"/>
          <bitfield caption="Lock Region 493" mask="0x00002000" name="LOCK_REGION_493"/>
          <bitfield caption="Lock Region 494" mask="0x00004000" name="LOCK_REGION_494"/>
          <bitfield caption="Lock Region 495" mask="0x00008000" name="LOCK_REGION_495"/>
          <bitfield caption="Lock Region 496" mask="0x00010000" name="LOCK_REGION_496"/>
          <bitfield caption="Lock Region 497" mask="0x00020000" name="LOCK_REGION_497"/>
          <bitfield caption="Lock Region 498" mask="0x00040000" name="LOCK_REGION_498"/>
          <bitfield caption="Lock Region 499" mask="0x00080000" name="LOCK_REGION_499"/>
          <bitfield caption="Lock Region 500" mask="0x00100000" name="LOCK_REGION_500"/>
          <bitfield caption="Lock Region 501" mask="0x00200000" name="LOCK_REGION_501"/>
          <bitfield caption="Lock Region 502" mask="0x00400000" name="LOCK_REGION_502"/>
          <bitfield caption="Lock Region 503" mask="0x00800000" name="LOCK_REGION_503"/>
          <bitfield caption="Lock Region 504" mask="0x01000000" name="LOCK_REGION_504"/>
          <bitfield caption="Lock Region 505" mask="0x02000000" name="LOCK_REGION_505"/>
          <bitfield caption="Lock Region 506" mask="0x04000000" name="LOCK_REGION_506"/>
          <bitfield caption="Lock Region 507" mask="0x08000000" name="LOCK_REGION_507"/>
          <bitfield caption="Lock Region 508" mask="0x10000000" name="LOCK_REGION_508"/>
          <bitfield caption="Lock Region 509" mask="0x20000000" name="LOCK_REGION_509"/>
          <bitfield caption="Lock Region 510" mask="0x40000000" name="LOCK_REGION_510"/>
          <bitfield caption="Lock Region 511" mask="0x80000000" name="LOCK_REGION_511"/>
        </register>
      </register-group>
    </module>
    <module name="CoreDebug" version="1.0.0" caption="Core Debug Register">
      <register-group name="CoreDebug" caption="Core Debug Register">
        <register name="DHCSR" offset="0x0" size="4" access-size="4" caption="Debug Halting Control and Status Register">
          <bitfield name="C_DEBUGEN" rw="RW" caption="" mask="0x1"/>
          <bitfield name="C_HALT" rw="RW" caption="" mask="0x2"/>
          <bitfield name="C_STEP" rw="RW" caption="" mask="0x4"/>
          <bitfield name="C_MASKINTS" rw="RW" caption="" mask="0x8"/>
          <bitfield name="C_SNAPSTALL" rw="RW" caption="" mask="0x20"/>
          <bitfield name="S_REGRDY" rw="R" caption="" mask="0x10000"/>
          <bitfield name="S_HALT" rw="R" caption="" mask="0x20000"/>
          <bitfield name="S_SLEEP" rw="R" caption="" mask="0x40000"/>
          <bitfield name="S_LOCKUP" rw="R" caption="" mask="0x80000"/>
          <bitfield name="S_RETIRE_ST" rw="R" caption="" mask="0x1000000"/>
          <bitfield name="S_RESET_ST" rw="R" caption="" mask="0x2000000"/>
          <bitfield name="DBGKEY" rw="W" caption="" mask="0xFFFF0000"/>
        </register>
